; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v1 - type_1 ?v5 - type_2)
 	      (pred_2 ?v7 - object ?v5 - type_2)
	      (pred_3 ?v1 - type_1 ?v6 - type_3)
	      (pred_4 ?v1 - type_1 ?v7 - object ?v6 - type_3))

   (:action op_3
       :parameters  (?v1 - type_1 ?v2 ?v3 - type_2)
       :precondition (and  (pred_1 ?v1 ?v2))
       :effect (and  (pred_1 ?v1 ?v3)
		     (not (pred_1 ?v1 ?v2))))

   (:action op_1
       :parameters (?v1 - type_1 ?v4 - object ?v8 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v8) (pred_1 ?v1 ?v8) (pred_3 ?v1 ?v6))
       :effect (and (pred_4 ?v1 ?v4 ?v6)
		    (not (pred_2 ?v4 ?v8)) 
		    (not (pred_3 ?v1 ?v6))))

   (:action op_2
       :parameters (?v1 - type_1 ?v4 - object ?v8 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v4 ?v6) (pred_1 ?v1 ?v8))
       :effect (and (pred_2 ?v4 ?v8)
		    (pred_3 ?v1 ?v6)
		    (not (pred_4 ?v1 ?v4 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_01 - type_1
obj_04 obj_06 - type_3
obj_09 obj_08 obj_02 - type_2
obj_07 obj_05 obj_03 - object)
(:init
(pred_1 obj_01 obj_02)
(pred_3 obj_01 obj_04)
(pred_3 obj_01 obj_06)
(pred_2 obj_07 obj_02)
(pred_2 obj_05 obj_09)
(pred_2 obj_03 obj_09)
)
(:goal
(and
(pred_2 obj_07 obj_08)
(pred_2 obj_05 obj_09)
(pred_2 obj_03 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_01 ?b obj_06))))
)
)

; plan
1. (op_1 obj_01 obj_07 obj_02 obj_04)
   deleted: (pred_2 obj_07 obj_02) (pred_3 obj_01 obj_04)
   added: (pred_4 obj_01 obj_07 obj_04)
   goals met: 1 of 3
2. (op_3 obj_01 obj_02 obj_08)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_08)
   goals met: 1 of 3
3. (op_2 obj_01 obj_07 obj_08 obj_04)
   deleted: (pred_4 obj_01 obj_07 obj_04)
   added: (pred_2 obj_07 obj_08) (pred_3 obj_01 obj_04)
   goals met: 2 of 3
4. (op_3 obj_01 obj_08 obj_09)
   deleted: (pred_1 obj_01 obj_08)
   added: (pred_1 obj_01 obj_09)
   goals met: 2 of 3
5. (op_1 obj_01 obj_03 obj_09 obj_04)
   deleted: (pred_2 obj_03 obj_09) (pred_3 obj_01 obj_04)
   added: (pred_4 obj_01 obj_03 obj_04)
   goals met: 2 of 3
6. (op_3 obj_01 obj_09 obj_02)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_02)
   goals met: 2 of 3
7. (op_2 obj_01 obj_03 obj_02 obj_04)
   deleted: (pred_4 obj_01 obj_03 obj_04)
   added: (pred_2 obj_03 obj_02) (pred_3 obj_01 obj_04)
   goals met: 3 of 3
